Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.IsReadOnly Property
 Gets a value indicating whether the collection is read-only.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace